# Используем официальный образ Node.js в качестве базового
FROM node:18-alpine

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем только файлы package.json и yarn.lock, чтобы оптимизировать сборку
COPY package.json yarn.lock ./

# Устанавливаем зависимости
RUN yarn install --frozen-lockfile

# Копируем остальные файлы проекта в контейнер
COPY . .

# Компилируем приложение (если используется TypeScript)
RUN yarn build

# Указываем порт, который будет использовать приложение
EXPOSE 3000

# Определяем команду для запуска приложения
CMD ["yarn", "start:prod"]
